<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>

<hr>

<a href="https://lms.clarusway.com/mod/lesson/view.php?id=2463&pageid=4531&startlastseen=no"><img align="center" src="https://i.ibb.co/6Z5pQxD/lmss.png" alt="Open in Clarusway LMS" width="70" height="200" title="Open Clarusway Learning Management Sytem"></a>

<a href="https://github.com/clarusway/DS-DE-0322-Students/blob/main/3-%20Classes%26Labs/2-DAwPY/DAwPy_S01_(Numpy_Arrays).ipynb"><img align="left" src="https://i.ibb.co/n3HWyQX/github-logo.png" alt="Open in Clarusway GitHub" width="90" height="150" title="Open and Execute in Clarusway GitHub Repository"></a>

<a href="https://nbviewer.org/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S1_%28Numpy_Arrays%29/DAwPy_S1_%28Numpy_Arrays%29.ipynb"><img align="right" src="https://i.ibb.co/48wtV8c/nbviewer-badge.png" alt="Open in nbviewer" width="100" height="100" title="Open and Execute in nbviewer"></a><br/>

<hr>

<p style="text-align: center;"><img src="https://i.ibb.co/Rpz9L36/clarusway-logo-black.png" width="500" height="200" class="img-fluid" alt="CLRSWY_LOGO"></p>

<p style="text-align: center;"><img src="https://i.ibb.co/XS0bxSH/best-bootcamps.png" width="300" height="200" class="img-fluid" alt="CLRSWY_LOGO"></p>

<p style="background-color:#E51A59; font-family:newtimeroman; color:#FDFEFE; font-size:130%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<p style="text-align: center;"><img src="https://i.ibb.co/99DQ3TY/DS-Courses.png" class="img-fluid" 
alt="CLRSWY_Courses"></p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 10</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#E51A59; font-size:200%; text-align:center; border-radius:10px 10px;">Working with Text & Time Data</p>



<img src=https://i.ibb.co/tLrfSDc/pandas-reading-book-on-beach.jpg width="400" height="200">

[Image created using Free Online AI Image Generator](https://www.canva.com/ai-image-generator/)


Raw text data often comes in a form that makes analysis difficult. As such, it often requires text processing methods. Text processing is the practice of automating the generation and manipulation of text. It can be used for many data manipulation tasks including feature engineering from text, data wrangling, web scraping, search engines and much more.

Data wrangling including removal, extraction, replacement and conversion. is the process of gathering and transforming data to address an analytical question. It‚Äôs also often the most important and time-consuming step of the entire data science pipeline. In this process, you can also use Pandas to replace words or phrases with more informative or useful text.

Today, using the basic Pandas tools and skills,  we‚Äôll look at how to perform extraction from text as well as conversion of string values into time stamps or generating the type of clean and interpretable text data that allows for insights [Source](https://builtin.com/data-science/data-wrangling-pandas).

<a id="toc"></a>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [WORKING WITH TEXT DATA](#0)
* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#00)
* [WORKING WITH TIME DATA](#1)
    * [String Methods](#1.1)
    * [Most Usefull String Methods](#1.2)
    * [Dummy Operations](#1.3)
* [WORKING WITH TIME DATA](#2)
    * [pd.to_datetime()](#2.1)
    * [Series.dt()](#2.2)
    * [Datetime Module](#2.3)
    * [Series.dt()](#2.4)
* [OPERATION WITH DATETIME OBJECT](#3)
* [THE END OF THE SESSION](#4)

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="00"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [1]:
import pandas as pd              # DAwPy
import numpy as np               # DAwPy
import seaborn as sns            # Stats-1 & DAwPy
import matplotlib.pyplot as plt  # Stats-1 & DAwPy

- **``Importing Libraries``**: Make sure to import the required libraries before beginning your. You need both pandas and numpy.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

- ``import warnings``: This imports the warnings module, which is part of Python's standard library and provides a way to issue warning messages.
- ``warnings.filterwarnings("ignore")``: This function call tells Python to ignore all warning messages that would normally be printed. This can be useful when we want to focus on the output of your program without being distracted by warnings.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#FF0000; font-size:125%; text-align:left;"><strong>üì¢ Caution ‚ùó‚ùó‚ùó</strong></p>


- Ignoring warnings can sometimes hide important issues in our code, so use this approach judiciously. It's generally better to address the underlying causes of warnings rather than suppressing them.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Text Data</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Pandas cannot only include text data as an object, it also includes any other data that pandas don‚Äôt understand. This means, if you say when a column is an Object dtype, and it doesn‚Äôt mean all the values in that column will be a string or text data. In fact, they may be numbers, or a mixture of string, integers, and floats dtype. So with this incompatibility, we can not do any string operations on that column directly. Due to this problem, string dtype is introduced from the pandas 1.0 version, but we need to define it explicitly for applying string functions.

**üßê [Pandas provides a set of string functions](https://pandas.pydata.org/docs/user_guide/text.html)** which make it easy to operate on string data. Most importantly, these functions ignore (or exclude) missing/NaN values. Almost, all of these methods work with Python string functions **üßê [Refer To Official Python Documentation]( https://docs.python.org/3/library/stdtypes.html#string-methods)**. So, while studying with the Series Object, convert it to String Object and then perform the operation.

To sum up, before pandas 1.0, only ‚Äúobject‚Äù datatype was used to store strings which cause some drawbacks because non-string data can also be stored using ‚Äúobject‚Äù datatype. Pandas 1.0 introduces a new datatype specific to string data which is StringDtype. According to **üßê [Pandas Official Document](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html)**, there are two ways to store text data in pandas:
- **Object -dtype NumPy array** (Object data type has a broader scope and allows to store pretty much anything).
- **StringDtype extension type**

**``One important thing``** to note here is that **object datatype is still the default datatype for strings**. To use StringDtype, we need to explicitly state it. Pandas recommend using StringDtype to store text data. However, ‚ÄúString‚Äù data type is not superior to ‚Äúobject‚Äù in terms of performance as of now **üßê [SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html), [SOURCE02](https://www.w3schools.com/python/python_ref_string.asp)**. 

**üßê [Why We Need to Use Pandas New String Dtype Instead of Object for Textual Data](https://towardsdatascience.com/why-we-need-to-use-pandas-new-string-dtype-instead-of-object-for-textual-data-6fd419842e24)**

**üßê [How do StringDtype objects differ from object dtype in Python Pandas?](https://www.tutorialspoint.com/how-do-stringdtype-objects-differ-from-object-dtype-in-python-pandas)**

**üßê [Pandas distinction between str and object types](https://stackoverflow.com/questions/34881079/pandas-distinction-between-str-and-object-types)**

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### REMINDER: Distinction between ``str`` and ``object`` types

``Numpy's string dtypes are NOT python strings``. Therefore, Pandas deliberately uses native Python strings, which require an object dtype.

In pandas, there is an important distinction between string types and object types, particularly when dealing with text data. Here's a concise overview of the differences:

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;">1. String Types in NumPy vs. Python</p>

- **NumPy String Dtypes:**
   - ``NumPy`` provides ``specific string dtypes`` like np.str_ or np.bytes_.
   - These are ``fixed-size`` and more efficient for certain operations but do ``NOT support the full range of string operations`` available in Python.
- **Python Strings:**
   - Native ``Python strings (str)`` are ``dynamic in size`` and support a wide range of methods for manipulation and formatting.
   - They are ``mutable`` and can represent any Unicode character.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;">2. Pandas' Choice of Data Types</p>

- **Object Dtype:**
   - In ``Pandas``, when text data is stored, it ``typically`` uses the ``object dtype``.
   - This is because ``object`` can ``hold any Python object``, including strings. As a result, Pandas can flexibly accommodate the varied lengths and complex operations associated with Python strings.
- **String Dtype:**
   - In more recent versions of Pandas, there is also a ``dedicated string dtype`` (introduced as ``pd.StringDtype()``).
   - This dtype is designed to be ``more efficient than object dtype for string operations`` and provides better performance for string-specific functionality.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;">3. Implications of Using Object Dtype</p>

   - When a Pandas Series or DataFrame column is of object dtype:
     - It can contain ``mixed data types`` (e.g., numbers, strings).
     - ``Operations on strings may be slower`` due to the overhead of handling generic objects.
   - If you want to ensure ``better performance with string operations``, you can ``convert an object dtype column to the new string dtype``:
     - ``df['column_name'] = df['column_name'].astype('string')``


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#F5051E; font-size:150%; text-align:left;">The main difference between the object-dtype in NumPy arrays and the StringDtype extension type in Pandas is how they handle string data.</p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;">1. Object dtype in NumPy Arrays:</p>

   - In NumPy, when an array contains elements of different types or when the array contains elements of more complex data structures (e.g., lists, dictionaries), the data type of the array is set to object. This means that the array elements are essentially treated as Python objects, and NumPy does not impose any restrictions on the type of data that can be stored in the array.
   - The object dtype provides flexibility but may come at the cost of performance, as NumPy loses the ability to utilize specialized operations on the data due to its generic nature. Additionally, operations on arrays with object dtype might be slower compared to arrays with more specific dtypes.
<br>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;">2. StringDtype Extension Type in Pandas:</p>

   - In Pandas, the StringDtype extension type is designed specifically to handle string data. It is a more efficient and specialized data type compared to the object dtype for handling text data. The StringDtype allows for vectorized string operations, which means that Pandas can perform string operations on entire columns of data efficiently, without the need for explicit loops.
   - The StringDtype is part of the Pandas extension types, and it was introduced in Pandas version 1.0.0 to provide more consistency and improved performance for string data handling. Before Pandas 1.0.0, strings were usually represented as object dtypes in Pandas Series.
   
In summary, while both object dtype in NumPy and StringDtype extension type in Pandas can store string data, the StringDtype is specifically designed for efficient string handling and provides better performance for string operations in the context of Pandas. If you are working with string data in Pandas, it is recommended to use the StringDtype whenever possible to take advantage of its benefits in terms of efficiency and functionality.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


**In this notebook, the **üßê [string operations](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm)** will first be discussed with our basic Series/Index and we will learn how to apply these string functions on the DataFrame.**

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">String Methods</p>

<a id="1.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Strings implement all of the common sequence operations, along with the additional methods described at [the official documentation](https://docs.python.org/3/library/stdtypes.html#string-methods).

Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (**Please see the information about** [str.format()](https://docs.python.org/3/library/stdtypes.html#str.format), [Format String Syntax](https://docs.python.org/3/library/string.html#formatstrings) and [Custom String Formatting](https://docs.python.org/3/library/string.html#string-formatting)) and the other based on C printf style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle ([printf-style String Formatting](https://docs.python.org/3/library/stdtypes.html#old-string-formatting)).

The [Text Processing Services](https://docs.python.org/3/library/text.html#textservices) section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the [re](https://docs.python.org/3/library/re.html#module-re) module).

Please watch [**``Video Source``**](https://www.youtube.com/watch?v=6JNwK6hEneg) for enhancing your understanding of working with Text Data in Pandas.  

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;"><strong>What are these String Methods? Now let us examine some of the most common and usefull String Methods and dig into them one by one:</strong></p>


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [2]:
# Load the DataFrame from the Excel file
df = pd.read_excel("text_exercise.xlsx")

# Display the DataFrame
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


**The following ``info()`` method provides a concise summary of the DataFrame, including the index data type, column names, non-null counts, data types of each column, and memory usage.**
- This is particularly useful for understanding the structure of our dataset and identifying any potential issues, such as missing values.

In [3]:
# Summary of the DataFrame

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 516.0+ bytes

The output from ``df.info()`` provides a ``summary of our DataFrame``, which contains important details about its structure and data types. Here‚Äôs a breakdown of the information provided:

**DataFrame Overview:**
- **``Class``**: Indicates that df is a Pandas DataFrame.
- **``RangeIndex``**: The DataFrame has ``8 entries (rows)``, ``indexed from 0 to 7``.
- **``Data Columns``**: There are a ``total of 6 columns`` in the DataFrame.
- **``Column Names and Types``**:
   - **``id``**: ``8 non-null entries``, ``dtype: object``
   - **``staff``**: ``8 non-null entries``, ``dtype: object``
   - **``department``**: ``8 non-null entries``, ``dtype: object``
   - **``job``**: ``8 non-null entries``, ``dtype: object``
   - **``salary``**: ``8 non-null entries``, ``dtype: object``
   - **``age``**: ``8 non-null entries``, ``dtype: object``

**Key Insights:**
- **``Non-Null Count``**:
   - All columns have ``8 non-null entries``, which means there are ``no missing values`` in any of the columns.
- **``Data Types``**:
   -`` All columns`` are of ``object type``. This means that Pandas treats them as generic objects, which can include strings. However, the ``salary`` and ``age`` columns should ideally be numerical types for analysis purposes (e.g., integers or floats).
- **``Memory Usage``**:
   - The DataFrame is using approximately ``512 bytes of memory``.

**Recommendations for Data Cleaning:**
- Given that ``salary`` and ``age`` are currently of ``object type``, you may want to:
   - **``Convert salary to a Numeric Type``**:
     - Remove any non-numeric characters (like $, ,, or text) and convert the column to a numeric type (e.g., float).
   - **``Convert age to an Integer Type``**:
     - Ensure that any non-standard entries (e.g., -) are handled appropriately‚Äîeither by replacing them with a valid age or marking them as missing.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Most Usefull String Methods</p>

<a id="1.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:blue; font-size:150%; text-align:left;">üì¢‚ùóüö® In pandas, string methods are primarily applied to columns of type object or string. These methods allow for efficient manipulation and analysis of text data within DataFrames or Series.</p>

- **[str.lower()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.lower.html) =>** Converts a string into lower case
- **[str.upper()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.upper.html) =>** Converts a string into upper case
- **[str.capitalize()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.capitalize.html) =>** Converts the first character to upper case
- **[str.title()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.title.html) =>** Converts the first character of each word to upper case
- **[str.swapcase()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.swapcase.html) =>** Swaps the case lower/upper

**üßê [SOURCE01](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm)
[SOURCE02](https://www.aboutdatablog.com/post/10-most-useful-string-functions-in-pandas)
[SOURCE03](https://towardsdatascience.com/5-must-know-pandas-operations-on-strings-4f88ca6b8e25)
[SOURCE04](https://towardsdatascience.com/pandas-string-operations-explained-fdfab7602fb4)
[SOURCE05](https://blog.devgenius.io/string-operations-on-pandas-dataframe-88af220439d1)
[SOURCE06](https://www.geeksforgeeks.org/string-manipulations-in-pandas-dataframe/)**

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


## <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;"><strong>Part-01:</strong></p>


### ``str.lower()``:  

- returns a string where all characters are lower case.


**The following code ``converts all the entries`` in the ``"staff"`` column of the DataFrame to ``lowercase``.**

In [4]:
# Convert the "staff" column to lowercase

df["staff"].str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smiÃáth
6      adrian star
7     albert simon
Name: staff, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### ``str.upper()``  
- Used to convert strings in the Series/Index to uppercase. 

**The following code ``converts all the entries`` in the ``"staff"`` column of the DataFrame to ``uppercase``.**

In [5]:
# Convert the "staff" column to uppercase

df["staff"].str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMƒ∞TH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### ``str.title()`` 
- Used to convert strings in the Series/Index to titlecase.

**The following code ``converts all the entries`` in the ``"staff"`` column of the DataFrame to ``title case``.**

In [6]:
# Convert the "staff" column to title case

df["staff"].str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar SmiÃáth
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


### ``str.capitalize()``
- Used to capitalize the string elements in Pandas Series.

**The following code ``converts the first character of each string`` in the ``"staff"`` column to ``uppercase`` and ``all other characters`` to ``lowercase``.**

In [7]:
# Convert the "staff" column to capitalize

df["staff"].str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smiÃáth
6      Adrian star
7     Albert simon
Name: staff, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**``str.swapcase()``** 
- Returns a string where all the upper case letters is converted to lower case and vice versa.

**The following code ``converts all uppercase letters`` in the ``"staff"`` column to ``lowercase`` and ``all lowercase letters to uppercase``.**

In [8]:
# Convert the "staff" column by swapping case

df["staff"].str.swapcase()

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smiÃáth
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

## <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;"><strong>Part-02:</strong></p>

- **[str.isalpha()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.isalpha.html)     =>** Returns True if all characters in the string are in the alphabet
- **[str.isnumeric()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.isnumeric.html)   =>** Returns True if all characters in the string are numeric
- **[str.isalnum()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.isalnum.html)     =>** Returns True if all characters in the string are alphanumeric
- **[str.endswith()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.endswith.html)	  =>** Returns true if the string ends with the specified value
- **[str.startswith()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.startswith.html)  =>** Returns true if the string starts with the specified value
- **[str.contains()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.contains.html)    =>** Returns a Boolean value True for each element if the substring contains in the element, else False.

**üßê [SOURCE01](https://careerkarma.com/blog/python-isalpha-isnumeric-isalnum/)
[SOURCE02](https://careerkarma.com/blog/python-startswith-and-endswith/)
[SOURCE03](https://www.geeksforgeeks.org/python-startswith-endswidth-function/)
[SOURCE04](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.)**



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [9]:
# Let us remember our df

df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.isalpha()
- Function in pandas python checks whether the string consists of ``alphabetic characters only``. It returns True when alphabetic value is present and it returns False when the alphabetic value is not present.

**The following code snippet displays the ``"job"`` column from the DataFrame and ``check if each job title consists solely of alphabetic characters``:**

In [10]:
# Display the "job" column
display(df.job)

# Check if each job title is alphabetic
df.job.str.isalpha()

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

The job title ``"data scientist"`` contains a ``space`` between the words "data" and "scientist." The isalpha() method considers spaces as non-alphabetic characters, which leads to the result being False.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.isnumeric()
- Checks whether all characters in each string are ``numeric``. This is equivalent to running the Python string method **str.isnumeric()** for each element of the Series/Index.

In [11]:
# Display the "age" column
display(df["age"])

# Print the type of the first element in the "age" column
print(type(df.age[0]))

# Check if each age entry is numeric
df["age"].str.isnumeric()

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

<class 'int'>

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

üì¢‚ùóüö® This will return a ``Series of boolean`` values indicating`` whether each age entry is numeric``. However, the str.isnumeric() method will ``NOT work correctly due to the presence of a non-numeric character`` **``('-')``**.

üì¢‚ùóüö® The output, where many entries are NaN (Not a Number), likely indicates that the entries in the ``"age"`` column are not being recognized as strings. This can happen if there are ``leading`` or ``trailing spaces``, or if the entries are of ``mixed types`` (e.g., integers and strings).

**Possible Reasons for ``NaN`` Output:**
- **``Leading or Trailing Spaces:``**
   - If there are leading or trailing spaces in the age entries, the method may not recognize the values as valid strings for numeric checking.
- **``Mixed Data Types:``**
   - If the column contains integers, strings, and special characters (like '-'), pandas may interpret the column as an object type, but the string methods may not work as expected.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [12]:
# Convert the "age" column to string and check if each entry is numeric

df["age"].astype("string").str.isnumeric()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: boolean

**Explanation:**
- **``astype("string")``**: This converts the "age" column to a pandas string type, which allows for string operations to be applied consistently across all entries.
- **``str.isnumeric()``**: This method checks if each string consists only of numeric characters. It returns False for entries like '-' that are not numeric.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.isalnum()
- Function in python checks whether the string consists of ``alphanumeric characters``. It returns True when alphanumeric value is present and it returns False when the alphanumeric value is not present. Alphanumeric means a character that is ``either a letter or a number``.

In [13]:
# Display the "salary" column
display(df.salary)

# Check if each salary entry is alphanumeric
df["salary"].str.isalnum()

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

This returns a Series of boolean values indicating ``whether each salary entry consists solely of alphanumeric characters``.

**Explanation:**
- **``isalnum()``**: This method checks if each string consists only of alphanumeric characters (letters and numbers). It returns False for entries that contain special characters like ``$`` or ``,``, which are common in salary formats.

   - In this case, entries like ``"$150,000"`` and ``"$110,000"`` will return ``False``, while ``130000dolar`` and ``125000dolar`` will return ``True`` because they ``contain only alphanumeric character``s (üì¢‚ùóüö® but note that they are not in the proper currency format).

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.startswith()

Pandas **startswith()** tests if the start of each string element matches a pattern. It is yet another method to search and filter text data in Series or Data Frame. This method is Similar to Python‚Äôs startswith() method, but has different parameters and it works on Pandas objects only. Hence .str has to be prefixed everytime before calling this method, so that the compiler knows that it‚Äôs different from default function.

In [14]:
# Display the "job" column
display(df.job)

# Check if each job title starts with "d"
df["job"].str.startswith("d")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

This returns a ``Series of boolean values`` indicating ``whether each job title starts with the letter "d"``.

**Explanation:**
- **``startswith("d")``**: This method checks ``whether each string in the "job" column begins with the letter "d"``.
   - In this case, it will return ``True`` for ``job titles like "data scientist"``, while ``other titles that do not start with "d"`` will return ``False``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.endswith()

Pandas **endswith()** method is a built-in function that determines whether the given string ends with a specific sequence of characters.

In [15]:
# Display the "job" column
display(df.job)

# Check if each job title ends with "per"
df["job"].str.endswith("per")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

This will return a ``Series of boolean values`` indicating ``whether each job title ends with the string "per"``.

**Explanation:**
- **``endswith("per")``**: This method checks ``whether each string in the "job" column ends with the specified substring "per"``.
   - In this case, it will return ``True`` for ``job titles like "backend developer"`` and ``"frontend developer"``, while ``other titles that do not end with "per"`` will return ``False``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.contains()

The **contains()** method in Pandas allows you to search a column for a specific substring. The contains method returns boolean values for the Series with True for if the original Series value contains the substring and False if not **üßê [SOURCE](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.)**.

In [16]:
# Display the "job" column
display(df["job"])

# Check if each job title contains "data"
df["job"].str.contains("data")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

This will return a ``Series of boolean values`` indicating ``whether each job title contains the substring "data"``.

**Explanation:**
- **``contains("data")``**: This method checks ``whether each string in the "job" column contains the substring "data"``.
   - In this case, it will return ``True`` for ``job titles like "data scientist"``, while ``other titles that do not contain "data"`` will return ``False``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [17]:
# Display the "salary" column
display(df.salary)

# Check if each salary entry contains lowercase alphabetic characters
df["salary"].str.contains("[a-z]+")

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

This will return a ``Series of boolean values`` indicating ``whether each salary entry contains lowercase alphabetic characters``.

**Explanation:**
- **``contains("[a-z]+")``**: This method checks ``whether each string in the "salary" column contains at least one lowercase letter``.
   - In this case, it will return ``True`` for ``entries like "130000dolar" and "125000dolar"`` that include ``lowercase letters``, while ``other entries that do not contain lowercase letters`` will return ``False``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**We can use these string methods which returning boolean expression for creating condition and so selecting relative rows:**

In [18]:
# Filter the DataFrame for rows where the "job" column contains "data"

df[df["job"].str.contains("data")]

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

**Explanation:**
- **``df.job.str.contains("data")``**: Filters the DataFrame to ``include only those rows`` where ``the "job" column contains the substring "data"``.
   - This will include all ``entries for job titles`` like ``"data scientist"``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [19]:
# Retrieve the "department" values where the "job" contains "data"

df.loc[df["job"].str.contains("data"), "department"]

2    IT
6    IT
7    IT
Name: department, dtype: object

The output shows the ``"department"`` entries corresponding to ``job titles`` that contain ``"data"``:

**Explanation:**
- **``df.loc[...]``**: This method is used to access a group of rows and columns by labels or a boolean array.
- **``df.job.str.contains("data")``**: This condition checks which job titles contain the substring "data".
- **``"department"``**: This specifies that you want to retrieve the values from the "department" column for the filtered rows.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code snippet updates the ``"department"`` values in the DataFrame to ``"DS"`` for the rows where the "job" column contains the substring ``"data"``:**

In [20]:
# Update the "department" to "DS" where the "job" contains "data"
df.loc[df["job"].str.contains("data"), "department"] = "DS"

# Display the updated DataFrame
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         DS      data scientist   "$135,000"  40
7  E0006   Albert simon         DS      data scientist  125000dolar  35

**Explanation:**
- **``df.loc[...]``**: This is used to ``access/filter specific rows`` and ``columns`` in the DataFrame ``based on conditions``.
- **``df.job.str.contains("data")``**: This condition ``checks`` for ``job titles that contain the substring`` ``"data"``.
- **``"department"] = "DS"``**: This ``assigns`` the value ``"DS"`` to the "department" column ``for the filtered rows``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code snippet updates the ``"department"`` values in the DataFrame to ``"IT"`` for the rows where the "job" column contains the ``substring "data"``:**

In [21]:
# Update the "department" to "IT" where the "job" contains "data"
df.loc[df["job"].str.contains("data"), "department"] = "IT"

# Display the updated DataFrame
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

**Explanation:**
- **``df.loc[...]``**: This is used to ``access/filter specific rows`` and ``columns`` in the DataFrame ``based on conditions``.
- **``df.job.str.contains("data")``**: This condition ``checks`` for ``job titles that contain the substring`` ``"data"``.
- **``"department"] = "DS"``**: This ``assigns`` the value ``"IT"`` to the "department" column ``for the filtered rows``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

## <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;"><strong>Part-03:</strong></p>


- **[str.strip()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.lstrip.html)	=>** Returns a trimmed version of the string
- **[str.replace()](https://pandas.pydata.org/docs/reference/api/pandas.Series.replace.html) =>** Returns a string where a specified value is replaced with a specified value
- **[str.split()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html)	=>** Splits the string at the specified separator, and returns a list
- **[str.find()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.find.html)	=>** Searches the string for a specified value and returns the position of where it was found
- **[str.findall()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.findall.html)	=>** Returns a list of all occurrence of the pattern.
- **[str.join()](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.join.html)	=>** Converts the elements of an iterable into a string

In [22]:
# Let's remember our df

df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMƒ∞TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.strip()

**NOTE:** For a better using and understanding of strip, please revise escape characters in python **üßê [Source01 for Escape Characters](https://www.python-ds.com/python-3-escape-sequences) & [Source02 for Escape Characters](https://www.w3schools.com/python/gloss_python_escape_characters.asp)**

In [23]:
# Remove double quotes from the "salary" column

df["salary"].str.strip("\"")
df["salary"].str.strip('"')

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

**Explanation:**
- **``str.strip('"')``**: This method removes ``leading`` and ``trailing double`` quotes from each entry in the ``"salary"`` column. If there are no double quotes, the values remain unchanged.
- Note that in our original data, it seems we have double quotes around some salary values. If we want to ensure that all such quotes are removed, this method will work effectively.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [24]:
# Clean the "salary" column by removing leading and trailing double quotes and substring "dolar" from the end of the strings.

df["salary"].str.strip("\"").str.rstrip("dolar")

0    $150,000
1    $180,000
2    $150,000
3      130000
4    $110,000
5    $120,000
6    $135,000
7      125000
Name: salary, dtype: object

The output shows the cleaned salary values, with double quotes removed and "dolar" stripped from the end where applicable:

**Explanation:**
- **``str.strip('"')``**: This removes any ``leading`` and ``trailing double quotes`` from the salary strings.
- **``str.rstrip("dolar")``**: This removes the ``substring "dolar"`` from the end of the strings. Note that it removes each character in "dolar" individually until it encounters a character that is not part of that set.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code snippet cleans the ``"salary"`` entries in the DataFrame by chaining the ``str.strip()``, ``str.rstrip()``, and ``str.lstrip()`` methods. This will remove ``double quotes``, the ``substring "dolar"`` from the end, and the ``dollar sign $`` from the beginning of the salary strings.**

In [25]:
# Clean the "salary" column

df["salary"].str.strip("\"").str.rstrip("dolar").str.lstrip("$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

**Explanation:**
- **``str.strip('"')``**: Removes any ``leading`` and ``trailing`` ``double quotes`` from the salary strings.
- **``str.rstrip("dolar")``**: Removes the ``substring "dolar"`` from the ``end of the strings``.
- **``str.lstrip("$")``**: Removes the ``dollar sign $`` from the ``beginning of the strings``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code snippet will do the ``same thing`` as it removes ``double quotes``, the ``substring "dolar"`` from the end, and the ``dollar sign $`` from the beginning of the salary strings.**

In [26]:
# Clean the "salary" column

df["salary"].str.strip("\"dolar$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code snippet clean the "salary" entries in the DataFrame by using ``str.strip()`` to remove ``unwanted characters`` (double quotes, "dolar", and the dollar sign $) and then ``use str.replace()`` to ``remove commas``.**

In [27]:
df["salary"].str.strip("\"dolar$").str.replace(",", "")

#df.salary.str.strip("\"dolar$").replace(",", "") # "replace" method without "str" seeks specified character/characters as a full match

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

**Explanation:**
- **``str.strip("\"dolar$")``**: This removes any leading or trailing double quotes, "dolar", and the dollar sign $ from each string in the "salary" column.
- **``str.replace(",", "")``**: This removes commas from the salary strings.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code converts the ``salary entries`` to a ``numeric type (float)`` after ``stripping unwanted characters`` and ``removing commas``:**

In [28]:
# Clean the "salary" column, remove unwanted characters and convert to float

df["salary"].str.strip("\"dolar$").str.replace(",", "").astype(float)

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

**Explanation:**
- **``str.strip("\"dolar$")``**: Removes leading and trailing double quotes, "dolar", and the dollar sign $.
- **``str.replace(",", "")``**: Removes commas from the salary strings.
- **``astype(float)``**: Converts the cleaned string values to floats.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [29]:
# Update "salary" column
df["salary"] = df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)

# Display the updated "salary" column
df.salary

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [30]:
# Let's remmeber "age" feature

df["age"]

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.replace()

In [31]:
# Replace "-" with NaN in the "age" column

df["age"].replace("-", np.nan)

# df.age.str.replace("-", np.nan) # gives an error

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [32]:
# Update "age" column
df["age"] = df["age"].replace("-", np.nan)

# Display the updated "age" column
df["age"]

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### üî• Special Note: [``str.replace()``](https://pandas.pydata.org/docs/reference/api/pandas.Series.replace.html) vs [``.replace()``](https://www.programiz.com/python-programming/methods/string/replace) üî•

- **Purpose:** Use **str.replace** for substring replacements on a single string column, and **replace** for any general replacement on one or more columns.

- **Usage:** **str.replace** can replace one thing at a time. **replace** lets you perform multiple independent replacements, i.e., replace many things at once.

- **Default behavior:** **str.replace** enables regex replacement by default. **replace** only performs a full match unless the regex=True switch is used.

**replace()** works for string as well as non-string replacement. What's more, it is also meant to work for multiple columns at a time (you can access replace as a DataFrame method df.replace() as well, if you need to replace values across the entire DataFrame.

**üßê [What is the difference between Series.replace and Series.str.replace?](https://stackoverflow.com/questions/56625031/what-is-the-difference-between-series-replace-and-series-str-replace)**

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.get() & Indexing with .str[ ]

You can use **``[ ]``** notation to directly index by position locations **üßê [SOURCE](https://pandas.pydata.org/pandas-docs/version/0.15/text.html)**. 

**[pandas.Series.str.get](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.get.html)**

- Extract element from each component at specified position or with specified key.
- Extract element from lists, tuples, dict, or strings in each element in the Series/Index.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [33]:
# Let's remmeber "staff" feature

df["staff"]

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMƒ∞TH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [34]:
# Create a new column for first names
df["first_name"] = df.staff.str.title().str.split().str[0]

# Create a new column for last names
df["last_name"] = df.staff.str.title().str.split().str.get(1)

# Drop the original "staff" column
df.drop("staff", axis=1, inplace=True)

# Display the updated DataFrame
df

      id department                 job    salary   age first_name last_name
0  M0001         HR             manager  150000.0  52.0        Tom      Blue
1  M0002         IT             manager  180000.0  48.0       John     Black
2  E0001         IT      data scientist  150000.0  35.0    Micheal     Brown
3  E0002         HR           recruiter  130000.0  38.0      Jason    Walker
4  E0003         IT   backend developer  110000.0   NaN       Alex     Green
5  E0004         IT  frontend developer  120000.0  32.0      Oscar    SmiÃáth
6  E0005         IT      data scientist  135000.0  40.0     Adrian      Star
7  E0006         IT      data scientist  125000.0  35.0     Albert     Simon

**Explanation:**
- **``Extracting First Names``**:
   - **``df.staff.str.title()``**: Converts the names in the "staff" column to title case (capitalizes the first letter of each word).
   - **``str.split()``**: Splits each name into a list of words.
   - **``str[0]``**: Accesses the first element of the list (the first name).
- **``Extracting Last Names``**:
   - **Similar to the first name extraction, but str.get(1) is used to access the second element of the list (the last name).
- **``Dropping the Original Column``**:
   - **``df.drop("staff", axis=1, inplace=True)``**: Removes the "staff" column from the DataFrame.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [35]:
# Let's remmeber our DataFrame

df

      id department                 job    salary   age first_name last_name
0  M0001         HR             manager  150000.0  52.0        Tom      Blue
1  M0002         IT             manager  180000.0  48.0       John     Black
2  E0001         IT      data scientist  150000.0  35.0    Micheal     Brown
3  E0002         HR           recruiter  130000.0  38.0      Jason    Walker
4  E0003         IT   backend developer  110000.0   NaN       Alex     Green
5  E0004         IT  frontend developer  120000.0  32.0      Oscar    SmiÃáth
6  E0005         IT      data scientist  135000.0  40.0     Adrian      Star
7  E0006         IT      data scientist  125000.0  35.0     Albert     Simon



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [36]:
# Let's remmeber "job" feature

df["job"]

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.find() & str.rfind()

**str.find** returns ``lowest indexes`` in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.find().

**str.rfind** returns ``highest indexes`` in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.rfind().

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code snippet identfies the ``index positions`` of the ``substring "developer"`` for each job entry.**

**You can use the ``str.find()`` and this operation allows you to identify ``which job titles include the substring "developer"`` and ``where they occur in the string``. This method will return the ``index of the first occurrence`` of the ``substring``, and it will return ``-1`` if the substring is ``not found``.**

In [37]:
# Find the position of "developer" in the "job" column

df["job"].str.find("developer")

0   -1
1   -1
2   -1
3   -1
4    8
5    9
6   -1
7   -1
Name: job, dtype: int64

**Explanation:**
- **``str.find("developer")``**: This method checks each entry in the "job" column for the substring "developer".
   - If "developer" is found, it returns the starting index of the substring.
   - If "developer" is not found, it returns -1.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### str.findall()

**str.findall** finds ``all occurrences`` of pattern or regular expression in the Series/Index **üßê [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.findall.html)**.

In [38]:
# Display the "job" column
display(df["job"])

# Find all occurrences of "developer" in the "job" column
df["job"].str.findall("developer")

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

0             []
1             []
2             []
3             []
4    [developer]
5    [developer]
6             []
7             []
Name: job, dtype: object

**Explanation:**
- **``df.job.str.findall("developer")``**: This method ``searches`` each entry in the "job" column for the ``substring "developer"`` and returns a ``list of all occurrences found``.
   - If "developer" is found, it will appear in the list.
   - If ``not found``, it will return an ``empty list``.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code snippet add new columns to our DataFrame named ``"skills"`` and ``"Skills"``:**

In [39]:
# Let's add new features named "skils" and "Skills" to our DataFrame

df["skills"] = [[], ["Java", "C++"], ["Python", "Tableau", "SQL"], [], ["React", "Django"], ["JavaScript", "Python"], ["R", "SQL"], ["SQL", "Python"]]
df["Skills"] = [[], [], ["Python","Tableau","SQL"], [], ["React", "Django"], ["JavaScript", "Python"], ["R", "SQL"], ["SQL", "Python"]]
df.loc[1, "Skills"] = "Java, C++"

# Display the DataFrame
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java, C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,SmiÃáth,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


### str.join()

- If the elements of a Series are ``lists`` themselves, join the content of these lists using the delimiter passed to the function. This function is an equivalent to str.join() **üßê [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.join.html)**.

**Join** lists contained as elements in the Series/Index with passed delimiter.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


**We can use the ``str.join()`` method to ``concatenate the lists in the "skills"`` column into a ``single string`` for each row, separating the skills with a comma.**

In [40]:
# Concatenating the "skills" into a single string for each row

df["skills"].str.join(",")

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

**Explanation:**
- **``df.skills.str.join(",")``**: This method takes ``each list in the "skills"`` column and ``joins the elements into a single string``, ``separated by commas``.
   - A new column, skills_joined, is created to store the concatenated strings.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**You can similarly use the ``str.join()`` method on the ``"Skills"`` column to ``concatenate the lists of skills into a single string for each row``, ``separating`` the skills ``with a comma``:**

In [41]:
# Concatenating the : into a single string for each row

df["Skills"].str.join(",")

0
1     J,a,v,a,,, ,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

The **``issue``** we encounter with the output of the ``"Skills"`` column appears to be related to ``how the data is stored`` and then processed. Specifically, when we created the "Skills" column, we assigned a ``string directly`` for one entry, which can lead to ``unexpected behavior`` when we ``try to join lists with strings``.

**Fixing the Issue:**
- To ensure consistent behavior, you should maintain the same data structure (lists) for all entries in the "Skills" column. 

**Here‚Äôs how you can correct it:**
- Convert the string entry back into a list when updating the second row.
- Use the same structure throughout for ease of manipulation.

So, by ensuring that all entries in the "Skills" column are lists, you maintain consistency, and the str.join() method will work correctly without introducing unexpected characters.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [42]:
# Applying the function

df["Skills"].apply(lambda item: ",".join(item) if type(item) == list else item)

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [43]:
# Using list comprehension to join skills

[",".join(item) if type(item) == list else item for item in df["Skills"]]

['',
 'Java, C++',
 'Python,Tableau,SQL',
 '',
 'React,Django',
 'JavaScript,Python',
 'R,SQL',
 'SQL,Python']



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [44]:
# Using list comprehension to transform "Skills"
df["Skills"] = [",".join(item) if type(item) == list else item for item in df.Skills]

# Display the "Skills" column
df["Skills"]

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [45]:
# Let's check our DataFrame:

df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java, C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","Python,Tableau,SQL"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","React,Django"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,SmiÃáth,"[JavaScript, Python]","JavaScript,Python"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","R,SQL"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","SQL,Python"



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;"><strong>Wrap-up:</strong></p>

**Difference between Object dtype and StringDtype extension type in Pandas:**

Pandas offers two main ways to handle string data: the object dtype and the StringDtype extension type. Here are the key differences between them:

1. ``Object dtype in Pandas:``

   - When a Pandas Series contains strings, and the data type of the Series is not explicitly specified, the default dtype used is object. This means that the elements in the Series are treated as generic Python objects, which can hold any data type, including strings, integers, lists, and more.
   - The object dtype is a catch-all data type and is not optimized for string-specific operations. As a result, vectorized string operations are not available when using the object dtype. This may lead to less efficient string processing, especially when dealing with large datasets.
<br>

2. ``StringDtype extension type in Pandas:``

   - In Pandas, the StringDtype extension type is specifically designed for working with string data. It provides better performance and supports vectorized string operations, which allow you to apply string operations to entire Series efficiently without using explicit loops.
   - The StringDtype extension type is part of the Pandas extension types introduced in version 1.0.0, aiming to provide consistency and improved performance for string handling. It is optimized for string-specific operations and allows for more efficient memory usage when working with string data.

``Key Points:``

   - When dealing with string data in Pandas, using the StringDtype extension type is recommended over the object dtype for better performance and memory efficiency.
The StringDtype extension type provides enhanced support for vectorized string operations, making it more convenient for string manipulation tasks.
   - The object dtype should be used when the data in a Pandas Series contains different types (e.g., strings, numbers, lists), and you want to handle it in a more generic way. However, note that this may lead to reduced performance for string-specific operations.
   
In summary, the StringDtype extension type in Pandas is the preferred option when working with string data, as it offers better performance and supports specialized string operations compared to the generic object dtype.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Dummy Operations</p>

<a id="1.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- A dataset may contain various type of values, sometimes it consists of categorical values. So, in-order to use those categorical value for programming efficiently we need to create dummy variables. A dummy variable is a **``binary variable``** that indicates whether a separate categorical variable takes on a specific value [SOURCE](https://www.geeksforgeeks.org/how-to-create-dummy-variables-in-python-with-pandas/).

- A **``dummy operation``** is a **``technique used in data analysis and programming to create placeholder values or variables that serve specific purposes without carrying meaningful data``**. In the context of data manipulation, dummy operations often involve generating **``dummy variables to represent categorical data numerically``**, enabling more effective statistical analysis and machine learning applications. This approach helps streamline datasets, making them easier to work with while maintaining the integrity of the original information. Dummy operations facilitate various tasks, including regression analysis and model training, by allowing algorithms to interpret categorical features as numerical inputs.

### get_dummies()

- **SYNTAX-1:** <b>``pd.get_dummies(data, prefix=None, prefix_sep="_",)``</b><br>
            **OR**<br>
- **SYNTAX-1:** <b>``df["col_name"].get_dummies(sep = ",")``</b><br>

- **Parameters:**
  - **``data=``** input data i.e. it includes pandas data frame. list . set . numpy arrays etc.
  - **``prefix=``** Initial value
  - **``prefix_sep=``** Data values separation.
  - **``Return Type``**: Dummy variables.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


**The following command ``converts categorical variable(s) in the department column`` of the DataFrame into ``dummy/indicator variables``.**
- This operation is particularly useful in preparing data for machine learning models, which typically require numerical input.

In [46]:
# Create dummy variables for the 'department' column

pd.get_dummies(df.department)

      HR     IT
0   True  False
1  False   True
2  False   True
3   True  False
4  False   True
5  False   True
6  False   True
7  False   True

As seen, **``two(2) dummy variables are created``** for the **``three categorical values of the "department"``** attribute. We can create dummy variables in python using **``get_dummies()``** method.


- **``Explanation of the Command:``**
  - **``pd.get_dummies()``**: This function from the Pandas library creates a new DataFrame where each category in the specified column becomes a separate column with binary values (0 or 1). A value of 1 indicates the presence of that category, while 0 indicates its absence.
  - **``df.department``**: This specifies the column to be transformed. The function will analyze the unique values in the department column and generate corresponding dummy variables.

- **``Explanation of the Output:``**
  - The output contains two new columns (**``one for each unique department``**) with binary indicators showing whether each employee belongs to that department. Each column represents one of the categories, with binary values indicating the presence (1) or absence (0) of that category for each row.
  - This transformation allows for easier analysis or modeling, as machine learning algorithms typically require numerical input.


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;">üì¢‚ùóüö® Dummies with <span style="color:red;">drop_first=True</span> parameter can be used to <span style="color:red;">drop the first column</span>. drop_first=True is important to use, as it helps in <span style="color:red;">reducing the extra column created during dummy variable creation</span>. Hence it <span style="color:red;">reduces the correlations created among dummy variables</span>. In other words it <span style="color:red;">drops the first dummy to avoid the creation of correlated features</span>. </p>

[SOURCE](https://stackoverflow.com/questions/63661560/drop-first-true-during-dummy-variable-creation-in-pandas#:~:text=1%20Answer,correlations%20created%20among%20dummy%20variables.).


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``converts the categorical variable in the department column`` of the DataFrame into ``dummy/indicator variables`` while ``dropping the first category``.**
- This is useful for avoiding the **``"dummy variable trap"``** in statistical modeling, **``where one category can be perfectly predicted from the others``**.

In [47]:
# Create dummy variables for the 'department' column, dropping the first category

pd.get_dummies(df.department, drop_first=True)

      IT
0  False
1   True
2   True
3  False
4   True
5   True
6   True
7   True

- **``Explanation of the Command:``**
pd.get_dummies()``**: This function creates a new DataFrame where each unique category in the specified column becomes a separate column with binary values (0 or 1).
- **``drop_first=True``**: This parameter tells Pandas to drop the first dummy variable column created. By doing so, it helps prevent multicollinearity by ensuring that the remaining columns represent the categories without redundancy.


- **``Explanation of the Output:``**
  - In this example, if HR is the first category alphabetically, it gets dropped, resulting in dummy variables for Engineering and Marketing.
--  Each remaining column indicates the presence (1) or absence (0) of that category for each employee.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [48]:
# Access the department feature

df["Skills"]

0
1             Java, C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

The output indicates that the **``Skills``** column in our DataFrame contains **``strings representing various skills for each entry``**, with **``some entries being empty``**. 

- **``Content``**: Each entry in the Skills column lists skills separated by commas. Some entries are empty, indicating that no skills are listed for those individuals.
- **``Data Type``**: The data type is object, which is typical for string data in Pandas.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``creates dummy variables`` from the ``Skills column`` in our DataFrame, where each unique skill becomes a separate column.**
- The **``sep=","``** argument specifies that the skills are separated by commas.

In [49]:
# Create dummy variables for the 'Skills' column

df["Skills"].str.get_dummies(sep=",")

    C++  Django  Java  JavaScript  Python  R  React  SQL  Tableau
0     0       0     0           0       0  0      0    0        0
1     1       0     1           0       0  0      0    0        0
2     0       0     0           0       1  0      0    1        1
3     0       0     0           0       0  0      0    0        0
4     0       1     0           0       0  0      1    0        0
5     0       0     0           1       1  0      0    0        0
6     0       0     0           0       0  1      0    1        0
7     0       0     0           0       1  0      0    1        0

**``Explanation of the Command:``**
- **``df.Skills.str.get_dummies(sep=",")``**: This method applies the string method get_dummies to the Skills column. It splits each string by the specified separator (in this case, a comma) and creates a new column for each unique skill. Each entry in these new columns will have a 1 if the skill is present and 0 if it is not.

**``Explanation of the Output:``**
- Each unique skill becomes a column in the new DataFrame (skills_dummies).
- The values in these columns indicate whether each employee possesses the corresponding skill (1) or not (0).
- Rows with no skills (empty strings) will have all zeroes in the dummy variable columns.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``sreates dummy variables`` from the ``Skills column`` in our DataFrame, with each unique skill represented as a separate column.**
- The add_prefix("skills_") method is then applied to prepend "skills_" to the names of these new columns.

In [50]:
# Create dummy variables for the 'Skills' column and add a prefix

df.Skills.str.get_dummies(sep=",").add_prefix("skills_")

,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,0,0,0,0,0,0,0,0,0
1,1,0,1,0,0,0,0,0,0
2,0,0,0,0,1,0,0,1,1
3,0,0,0,0,0,0,0,0,0
4,0,1,0,0,0,0,1,0,0
5,0,0,0,1,1,0,0,0,0
6,0,0,0,0,0,1,0,1,0
7,0,0,0,0,1,0,0,1,0

**``Explanation of the Command:``**
- **``df.Skills.str.get_dummies(sep=",")``**: This part creates a DataFrame where each unique skill from the Skills column becomes a column in the new DataFrame, with binary values (1 or 0) indicating the presence or absence of that skill.
- **``.add_prefix("skills_")``**: This method adds the prefix "skills_" to each of the new column names, making it clear that these columns represent skills.

**``Explanation of the Output:``**
- **``df.Skills.str.get_dummies(sep=",")``**: This part creates a DataFrame where each unique skill from the Skills column becomes a column in the new DataFrame, with binary values (1 or 0) indicating the presence or absence of that skill.
- **``.add_prefix("skills_")``**: This method adds the prefix "skills_" to each of the new column names, making it clear that these columns represent skills.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code creates a one-hot encoded (OHE) DataFrame from a column containing categorical data, specifically from a column named Skills in a DataFrame named.**

In [51]:
# Create dummy variables for the Skills column

skills_dummy = df.Skills.str.get_dummies(sep=",").add_prefix("skills_")



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command creates a new DataFrame called df_final that includes only the specified columns (department, job, salary, and Skills) from the original DataFrame.**
- This operation is useful for narrowing down the DataFrame to include only the relevant information you want to analyze or work with.

In [52]:
# Create a new DataFrame with selected columns
df_final = df[["department", "job", "salary", "Skills"]]

# Display the new DataFrame
df_final

  department                 job    salary              Skills
0         HR             manager  150000.0
1         IT             manager  180000.0           Java, C++
2         IT      data scientist  150000.0  Python,Tableau,SQL
3         HR           recruiter  130000.0
4         IT   backend developer  110000.0        React,Django
5         IT  frontend developer  120000.0   JavaScript,Python
6         IT      data scientist  135000.0               R,SQL
7         IT      data scientist  125000.0          SQL,Python

**``Explanation of the Command:``**
- **``df[...]``**: This syntax is used to select specific columns from the DataFrame.
- **``["department", "job", "salary", "Skills"]``**: This list specifies the names of the columns to be included in the new DataFrame.

**``Explanation of the Output:``**
- **``New DataFrame``**: df_final contains only the specified columns: department, job, salary, and Skills.
- **``Data Retention``**: All the data in these columns from the original DataFrame df is retained, while other columns are excluded.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``combines the DataFrame df_final with another DataFrame called skills_dummy``.**
- This operation typically **``merges the two DataFrames``** based on their **``index,``** appending the columns from skills_dummy to df_final.

In [53]:
# Join the dummy variables with df_final

df_final.join(skills_dummy)

,department,job,salary,Skills,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,HR,manager,150000.0,,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,"Java, C++",1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,"Python,Tableau,SQL",0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,"React,Django",0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,"JavaScript,Python",0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,"R,SQL",0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,"SQL,Python",0,0,0,0,1,0,0,1,0

**``Explanation of the Command:``**
- **``df_final``**: This is the primary DataFrame that contains selected columns such as department, job, salary, and Skills.
- **``skills_dummy``**: This DataFrame contains dummy variables representing the skills of employees, created earlier using str.get_dummies(sep=",").add_prefix("skills_").
- **``.join()``**: This method combines the two DataFrames along their index. If the indices match, it will align the rows; if not, it will fill in missing values with NaN.

**``Explanation of the Output:``**
- **``Combined DataFrame``**: The df_combined DataFrame contains all columns from df_final along with the dummy variables from skills_dummy.
- **``New Columns``**: Each column from skills_dummy represents a skill with binary indicators (1 or 0) showing whether each employee possesses that skill.
- **``Alignment``**: The rows are aligned based on their original indices.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following commands ``combines two DataFrames``, ``df_final`` and ``skills_dummy``, by first ``adding one-hot encoded columns for skills`` and then ``removing the original Skills column``.**
- This method **``adds the columns from skills_dummy to df_final``**, aligning them **``based on the index``** of the DataFrames.**
- Then **``removes the original Skills``** column.

In [54]:
# Join the skills_dummy DataFrame to df_final
df_final = df_final.join(skills_dummy)

# Removes the Skills column from df_final
df_final.drop("Skills", axis=1, inplace=True)

**``Explanation of the Command:``**
- **``Joining Dummy Variables:``**
  - **``df_final = df_final.join(skills_dummy)``**: This command merges the skills_dummy DataFrame (which contains dummy variables for skills) with df_final. The resulting DataFrame retains all the original columns from df_final, along with the new columns from skills_dummy.
- **``Dropping the Original Skills Column:``**
  - **``df_final.drop("Skills", axis=1, inplace=True)``**: This command removes the Skills column from df_final. The axis=1 parameter specifies that a column is being dropped, and inplace=True modifies df_final directly without creating a copy.

**``Explanation of the Output:``**
- **``Final DataFrame``**: The df_final DataFrame now contains the columns department, job, salary, and the dummy variables representing the skills.
- **``No 'Skills' Column``**: The original Skills column has been removed, as indicated by the absence of that column in the output.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [55]:
# Display the final DataFrame

df_final

,department,job,salary,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,HR,manager,150000.0,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,0,0,0,0,1,0,0,1,0

**``Explanation of the Command:``**
- **``Final DataFrame``**: The df_final DataFrame now contains the columns department, job, salary, and the dummy variables representing the skills.
- **``No 'Skills' Column``**: The original Skills column has been removed, as indicated by the absence of that column in the output.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``converts categorical variables`` in the df_final DataFrame into dummy/indicator variables while dropping the first category for each variable.**
- This helps avoid the "dummy variable trap" in regression analysis, where one category can be perfectly predicted by the others.

In [56]:
# Create dummy variables, dropping the first category

pd.get_dummies(df_final, drop_first=True)

,salary,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000.0,0,0,0,0,0,0,0,0,0,False,False,False,True,False
1,180000.0,1,0,1,0,0,0,0,0,0,True,False,False,True,False
2,150000.0,0,0,0,0,1,0,0,1,1,True,True,False,False,False
3,130000.0,0,0,0,0,0,0,0,0,0,False,False,False,False,True
4,110000.0,0,1,0,0,0,0,1,0,0,True,False,False,False,False
5,120000.0,0,0,0,1,1,0,0,0,0,True,False,True,False,False
6,135000.0,0,0,0,0,0,1,0,1,0,True,True,False,False,False
7,125000.0,0,0,0,0,1,0,0,1,0,True,True,False,False,False

**``Explanation of the Command:``**
- **``pd.get_dummies()``**: This function from the Pandas library creates a new DataFrame where each unique category in the specified categorical columns is transformed into a separate column with binary values (0 or 1).
- **``drop_first=True``**: This parameter tells Pandas to drop the first dummy variable column created for each categorical feature, which helps reduce multicollinearity in regression models.

**``Explanation of the Output:``**
- **``Dummy Variables Created``**: Each categorical column has been transformed into multiple binary columns. For example, the department column results in department_Engineering, department_Finance, and department_Marketing.
- **``Dropped Categories``**: The first category of each feature (like the first department) has been dropped to prevent collinearity.
- **``Original Numeric Columns``**: The salary column remains unchanged since it is already numeric.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**After execution of the following command, the df_final DataFrame will be transformed to include dummy variables for the categorical columns, with the first category of each variable dropped.**

In [57]:
# Create dummy variables, dropping the first category and reassigning it to itself

df_final = pd.get_dummies(df_final, drop_first = True)

# Display the final DataFrame
df_final

,salary,skills_ C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000.0,0,0,0,0,0,0,0,0,0,False,False,False,True,False
1,180000.0,1,0,1,0,0,0,0,0,0,True,False,False,True,False
2,150000.0,0,0,0,0,1,0,0,1,1,True,True,False,False,False
3,130000.0,0,0,0,0,0,0,0,0,0,False,False,False,False,True
4,110000.0,0,1,0,0,0,0,1,0,0,True,False,False,False,False
5,120000.0,0,0,0,1,1,0,0,0,0,True,False,True,False,False
6,135000.0,0,0,0,0,0,1,0,1,0,True,True,False,False,False
7,125000.0,0,0,0,0,1,0,0,1,0,True,True,False,False,False

**``Explanation of the Command:``**
- **``salary``**: The numeric salary of the employee.
- **``skills_C++, skills_Data Analysis, etc.``**: Dummy variables indicating whether the employee possesses a specific skill (1 for yes, 0 for no).
- **``department_Engineering, department_Finance, etc.``**: Dummy variables for the department, with the first department (e.g., HR) dropped.
- **``job_Analyst, job_Developer, etc.``**: Dummy variables for the job title, with the first job (e.g., Recruiter) dropped.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Time Data</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Time data plays a crucial role in various fields, including finance, healthcare, and data analysis. Effectively managing time-related information allows us to uncover trends, make predictions, and derive insights from time-series data. As someone who works with time series data on almost a daily basis, it's clear that the pandas Python package is extremely useful for time series manipulation and analysis. This basic introduction to time series data manipulation with pandas should allow you to get started in your time series analysis. Specific objectives are how to:
- create a date range
- work with timestamp data
- convert string data to a timestamp
- index and slice your time series data in a data frame
- resample your time series for different time period aggregates/summary statistics
- compute a rolling statistic such as a rolling average
- work with missing data
- understand the basics of unix/epoch time
- understand common pitfalls of time series data analysis [SOURCE](https://towardsdatascience.com/basic-time-series-manipulation-with-pandas-4432afee64ea)
<br>

- **``Key Concepts:``**
  - **``Time Formats``**: Time data can be represented in various formats, such as timestamps, dates, and durations. Understanding these formats is essential for accurate data manipulation.
  - **``Time Zones``**: Handling time zones is critical when working with global data. Converting time data to a common timezone ensures consistency and accuracy in analysis.
  - **``Resampling and Frequency Conversion``**: Time data often requires resampling to different frequencies (e.g., hourly, daily, monthly) to facilitate better analysis and visualization.
  - **``Time Series Analysis``**: This involves techniques for analyzing time-ordered data, including trend analysis, seasonal decomposition, and forecasting.
  - **``Libraries and Tools``**: Libraries like Pandas in Python offer robust functions for handling time data, including datetime manipulation, time series operations, and time zone handling.
- **``Applications:``**
  - **``Finance``**: Analyzing stock prices over time to identify trends and make investment decisions.
  - **``Healthcare``**: Tracking patient data over time to monitor health outcomes.
Sales``**: Understanding sales patterns to optimize inventory and marketing efforts.

In this section, we will introduce how to work with each of these types of date/time data in Pandas. This short section is by no means a complete guide to the time series tools available in Python or Pandas, but instead is intended as a broad overview of how you as a user should approach working with time series [SOURCE](https://jakevdp.github.io/PythonDataScienceHandbook/03.11-working-with-time-series.html).

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">pd.to_datetime()</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

For more and detailed information about to_datetime() metod, please [Visit Official Document](https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html)

**``pd.to_datetime()``** Converts argument to datetime.

This function converts a **``scalar``**, **``array-like``**, **``Series``** or **``DataFrame/dict-like``** to a pandas datetime object.

**As stated above, many input types are supported, and lead to different output types:**

- **``scalars``** can be int, float, str, datetime object (from stdlib datetime module or numpy). They are converted to Timestamp when possible, otherwise they are converted to datetime.datetime. None/NaN/null scalars are converted to NaT.

- **``array-like``** can contain int, float, str, datetime objects. They are converted to DatetimeIndex when possible, otherwise they are converted to Index with object dtype, containing datetime.datetime. None/NaN/null entries are converted to NaT in both cases.

- **``Series``** are converted to Series with datetime64 dtype when possible, otherwise they are converted to Series with object dtype, containing datetime.datetime. None/NaN/null entries are converted to NaT in both cases.

- **``DataFrame/dict-like``** are converted to Series with datetime64 dtype. For each row a datetime is created from assembling the various dataframe columns. Column keys can be common abbreviations like [‚Äòyear‚Äô, ‚Äòmonth‚Äô, ‚Äòday‚Äô, ‚Äòminute‚Äô, ‚Äòsecond‚Äô, ‚Äòms‚Äô, ‚Äòus‚Äô, ‚Äòns‚Äô]) or plurals of the same.

[Special Note :](https://pandas.pydata.org/docs/getting_started/intro_tutorials/09_timeseries.html)

As many data sets do contain datetime information in one of the columns, pandas input function like [pandas.read_csv()](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html#pandas.read_csv) and [pandas.read_json()](https://pandas.pydata.org/docs/reference/api/pandas.read_json.html#pandas.read_json) can do the transformation to dates when reading the data using the **``parse_dates parameter``** with a list of the columns to read as Timestamp.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:blue; font-size:125%; text-align:left;">üì¢üëâ Why are these ``pandas.Timestamp`` objects useful? Let's illustrate the added value with some example cases. In this sense, let us assume that we want to work with the dates in the column datetime as datetime objects instead of plain text.</p>


**The following command loads a ``CSV file`` named ``time_exercise.csv`` into a Pandas DataFrame.**

In [58]:
# Read and load the CSV
df = pd.read_csv("time_exercise.csv")

# Display the DataFrame
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

**The DataFrame contains the following columns:**

- **``id_product``**: A unique identifier for each product.
- **``order_date``**: The date when the product was ordered.
- **``product_quantity``**: The quantity of the product ordered.
- **``product_price``**: The price of the product.
- **``entry_date``**: The date when the product entry was recorded.

**``Key Considerations:``**
- **``Date Parsing``**: Ensure that the order_date and entry_date columns are parsed as datetime objects for proper time series analysis. We can do this using **``pd.to_datetime()``**.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>



**The following ``info()`` method provides a concise summary of the DataFrame, including the index data type, column names, non-null counts, data types of each column, and memory usage.**
- This is particularly useful for understanding the structure of our dataset and identifying any potential issues, such as missing values.

In [59]:
# Summary of the DataFrame

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

- **``Non-Null Counts``**: All columns contain 911 non-null values, meaning there are no missing values in any of the columns.
- **``Data Types:``**
  - **``id_product``**: An integer (int64), suitable for unique identifiers.
  - üëâ **``order_date and entry_date``**: Stored as object, which typically means they are strings. These columns should be converted to datetime for proper time series analysis.
  - **``product_quantity and product_price``**: Floating-point numbers (float64), appropriate for quantities and prices.
- **``Memory Usage``**: The DataFrame uses approximately 35.7 KB of memory, indicating a relatively small dataset.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``accesses the order_date column`` from the DataFrame. This will return a Pandas Series containing all the values in that column.**

In [60]:
df["order_date"]

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:blue; font-size:125%; text-align:left;">üì¢üëâ Initially, the ``values in datetime`` are character ``strings`` and do ``NOT provide any datetime operations`` (e.g. extract the year, day of the week,‚Ä¶). By applying the ``to_datetime()`` function, pandas interprets the strings and convert these to datetime (i.e. ``datetime64[ns, UTC]``) objects. In pandas we call these datetime objects similar to datetime.datetime from the standard library as ``pandas.Timestamp``</p> 

**[pandas.Timestamp](https://pandas.pydata.org/docs/reference/api/pandas.Timestamp.html#pandas.Timestamp)**


- **``Type``**: The output will be a Pandas Series. If the order_date column is still in object format (as indicated in our previous info() output), the data type will be object.
- **``Accessing Data``**: We can perform various operations on this Series, such as filtering, calculating statistics, or converting to datetime format if we haven‚Äôt done so already.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [61]:
# df.order_date.max() - df.order_date.min()

# TypeError: unsupported operand type(s) for -: 'str' and 'str'

- **``The error TypeError: unsupported operand type(s) for -: 'str' and 'str'``** occurs because the Series a contains strings, and we're trying to perform a subtraction operation (max() - min()) on string values. In Python, we CANNOT subtract one string from another, which leads to this error.


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``converts the values in the order_date column`` of the DataFrame from their current format (likely as strings or objects) into Pandas datetime objects.**
- This conversion is essential for performing time-based operations and analyses.

In [62]:
# Convert the values in the "order_date" column

pd.to_datetime(df["order_date"])

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

**``Key Points:``**
- **``Conversion``**: This function will **``parse the values in the order_date column``** and **``convert them into datetime64 format``**. This allows us to easily perform date and time operations, such as filtering, resampling, and calculating differences between dates.
- **``Error Handling``**: If there are **``any invalid date formats``** in the order_date column, **``pd.to_datetime() will raise an error by default``**. We can use the errors parameter to handle such cases:
  - **``errors='coerce'``**: Converts invalid dates to NaT (Not a Time).
  - **``errors='ignore'``**: Returns the original input if parsing fails.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``converts the entry_date and order_date columns`` in the DataFrame from their current formats (likely strings or objects) into Pandas datetime64 objects.**

In [63]:
# Parse the values in the "entry_date" and "order_date" columsn and Convert them into "datetime64 format"

df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command display the first five rows of the DataFrame.**

In [64]:
# Access the first five entries

df.head()

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04
3         778 2019-12-27               1.0     335.988000 2018-12-04
4         826 2020-02-19               1.0     342.292302 2018-12-04



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following ``info()`` method ``provides a concise summary of the DataFrame``, including the index data type, column names, non-null counts, data types of each column, and memory usage.**
- This is particularly useful for understanding the structure of our dataset and identifying any potential issues, such as missing values.

In [65]:
# Summary of the DataFrame

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

- **``Non-Null Counts``**: All columns have 911 non-null values, indicating that there are no missing values in your dataset.
- **``Data Types:``**
  - **``id_product``**: Stored as int64, suitable for unique identifiers.
  - **``order_date``**: Converted to datetime64[ns], allowing for time-based operations.
  - **``product_quantity and product_price``**: Stored as float64, which is appropriate for numerical values.
  - **``entry_date``**: Also in datetime64[ns], indicating successful conversion.
- **``Memory Usage``**: The DataFrame uses approximately 35.7 KB of memory, which is efficient for a dataset of this size.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:125%; text-align:left;"><strong>Now let's apply some ``aggregate methods`` for Datatime object at the given dataset:</strong></p>


**The following command finds the earliest date in the entry_date column of the DataFrame.**
- This will return the minimum value, which represents the earliest (December 04, 2018) entry date in the dataset.

In [66]:
# Find the "minimum value (date)" in the "entry_date"

df["entry_date"].min()

Timestamp('2018-12-04 00:00:00')

- **``Earliest Entry Date``**: The result signifies that the oldest entry recorded in your dataset is from December 4, 2018.
- **``Data Type``**: The result is a Pandas Timestamp object, which is a specific type used to represent dates and times in a more efficient way than standard Python datetime objects.


Knowing the earliest entry date can be useful for several analyses, such as:

- **``Time Range Analysis``**: Understanding the time span of our dataset.
- **``Data Quality Checks``**: Ensuring that the data collected aligns with expected time frames.
- **``Time Series Analysis``**: Setting the starting point for any time series visualizations or calculations.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command finds the latest date in the entry_date column of the DataFrame.**
- This will return the minimum value, which represents the oldest entry date (November 26, 2020) in the dataset.

In [67]:
# Find the "maximum value (date)" in the "entry_date"

df["entry_date"].max()

Timestamp('2020-11-26 00:00:00')

- **``Latest Entry Date``**: This result signifies that the most recent entry recorded in your dataset is from November 26, 2020.
- **``Data Type``**: Similar to the minimum date, the result is a Pandas Timestamp object, which allows for efficient date manipulation and comparison.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following ``calculates the time span`` covered by the entries in the entry_date column.**

In [68]:
# Calculate the time span in days

df.entry_date.max() - df.entry_date.min()


# # Calculate the time span in months
# months_span = time_span.days / 30  # Approximate
# print(f"Approximate time span in months: {months_span:.2f} months")

# # Calculate the time span in years
# years_span = time_span.days / 365  # Approximate
# print(f"Approximate time span in years: {years_span:.2f} years")

Timedelta('723 days 00:00:00')

- **``Time Span``**: The difference of 723 days represents the total duration from the earliest entry date (December 4, 2018) to the latest entry date (November 26, 2020).
- **``Data Type``**: The result is a Pandas Timedelta object, which is used to represent differences in time.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>üìå Extra Example-1 to Digest:</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:blue; font-size:125%; text-align:left;">üì¢‚ùóüö® The default date format used by Pandas when converting strings to datetime objects with pd.to_datetime() is typically ISO 8601 format, which is ``YYYY-MM-DD``. This format is widely recognized and used for representing dates in a standardized way.</p>

**The following code creates a Pandas Series a containing date strings in the format "DD-MM-YYYY".**
- Here‚Äôs how we can work with this Series, including converting the string dates into datetime objects for easier manipulation and analysis.

In [69]:
# Create the Series with a specified datetime format
time_series1 = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])

# Display the Series
time_series1

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#FF0000; font-size:125%; text-align:left;"><strong>‚ö†Ô∏è IMPORTANT Key Points ‚ùó‚ùó‚ùó</strong></p>

- **``Internal Representation``**: Once a date string is converted to a datetime64 object, it is **``stored internally in a standardized format (ISO 8601)``**. This is how Pandas represents dates for efficient storage and manipulation.
- **``Display Format``**: The display format of dates in Pandas will **``always show in ISO format``** when we print the Series or DataFrame. This does **``NOT change the underlying data``**; it just reflects **``how Pandas chooses to display it``**.
- **``Original Format``**: The format parameter in pd.to_datetime() is used **``only to correctly interpret the input string format during conversion``**. It does NOT affect how the resulting datetime64 object is displayed.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command finds the earliest date in the entry_date column of the DataFrame.**

In [70]:
# Find the "minimum value (date)" in the "time_series"

time_series1.min()

'15-03-2020'

The output returns the minimum value, which represents the earliest (March 15, 2020) entry date in the dataset.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command finds the latest date in the entry_date column of the DataFrame.**

In [71]:
# Find the "maximum value (date)" in the "time_series"

time_series1.max()

'24-07-2018'

The output returns the maximum value, which represents the oldest entry date (July 24, 2018) in the dataset.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [72]:
# time_series1.max() - time_series1.min()

# # Give an error of "TypeError: unsupported operand type(s) for -: 'str' and 'str'""

- **``The error TypeError: unsupported operand type(s) for -: 'str' and 'str'``** occurs because the Series a contains strings, and we're trying to perform a subtraction operation (max() - min()) on string values. In Python, we CANNOT subtract one string from another, which leads to this error.



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>üìå Extra Example-2 to Digest:</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:blue; font-size:125%; text-align:left;">üì¢‚ùóüö® The default date format used by Pandas when converting strings to datetime objects with pd.to_datetime() is typically ISO 8601 format, which is ``YYYY-MM-DD``. This format is widely recognized and used for representing dates in a standardized way.</p>


**The following command converts the Series, which contains date strings formatted as "DD-MM-YYYY", into Pandas datetime objects.**

In [73]:
# Create the Series with a specified datetime format

pd.to_datetime(time_series1, format='%d-%m-%Y')

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


**The following command converts the Series, which contains date strings formatted as "DD-MM-YYYY", into Pandas datetime objects.**

In [74]:
# Convert the Series to specified datetime format
time_series2 = pd.to_datetime(time_series1, format='%d-%m-%Y')

# Display the Series
time_series2

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

- **``Format Specification``**: The format='%d-%m-%Y' argument tells Pandas how to interpret the date strings:
  - **``%d``**: Day of the month as a zero-padded decimal number.
  - **``%m``**: Month as a zero-padded decimal number.
  - **``%Y``**: Year with century as a decimal number.
- **``Datetime Conversion``**: The pd.to_datetime() function converts the string representations of dates into Pandas datetime64 objects, enabling efficient date manipulation.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command finds the earliest date in the Series.**

In [75]:
# Find the "minimum value (date)" in the "time_series2"
min_date = time_series2.min()

# Display the earliest date in the Series
min_date

Timestamp('2018-07-24 00:00:00')

The output returns the minimum value, which represents the oldest entry date (July 07, 2018) in the dataset.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command finds the latest date in the Series.**

In [76]:
# Find the "maximum value (date)" in the "time_series2"
max_date = time_series2.max()

# Display the oldest date in the Series
max_date

Timestamp('2020-03-15 00:00:00')

The output returns the maximum value, which represents the oldest entry date (March 15, 2020) in the dataset.


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following ``calculates the time span`` covered by the entries in the Series.**

In [77]:
max_date - min_date

Timedelta('600 days 00:00:00')

- **``Time Span``**: The difference of 600 days represents the total duration from the earliest entry date (July 07, 2018) to the latest entry date (March 15, 2020).
- **``Data Type``**: The result is a Pandas Timedelta object, which is used to represent differences in time.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Series.dt()</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- **``Accessor object``** for datetimelike properties of the Series values [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html).

The **``Series.dt accessor``** in **``Pandas``** provides a set of methods and properties specifically designed for working with datetime data in a Pandas Series. It allows users to easily extract and manipulate various components of datetime objects, such as **``year``**, **``month``**, **``day``**, **``hour``**, **``minute``**, **``second``**, and more. Additionally, it supports **``operations``** like date **``arithmetic``** and **``formatting``**.

**``Key Features of Series.dt:``**
- **``Attribute Access``**: Access components like .dt.year, .dt.month, .dt.day, etc.
- **``Date Arithmetic``**: Perform operations such as adding or subtracting time intervals.
- **``Formatting``**: Format datetime objects for display purposes using .dt.strftime().
- **``Filtering``**: Easily filter data based on date attributes (e.g., extracting all entries from a specific month).

For a comprehensive information what the datetimelike properties, please visit [Official Pandas API Reference Document](https://pandas.pydata.org/pandas-docs/version/0.22/api.html#datetimelike-properties)


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


**The following command extracts the ``year`` component from the entry_date column in the DataFrame.** 
- This operation is made possible by the **``dt accessor``**, which provides **``access to datetime-specific properties``**.

In [78]:
# Extract the year from the entry_date column

df["entry_date"].dt.year 

# it can be date, year, quarter, month, week, day, weekday, dayofweek, hour, minute, second, microsecond

0      2018
1      2018
2      2018
3      2018
4      2018
       ...
906    2020
907    2020
908    2020
909    2020
910    2020
Name: entry_date, Length: 911, dtype: int32

- **``Extraction``**: The dt.year property accesses the year component of each datetime object in the entry_date Series.
- **``Type``**: The result is a Series of integers representing the years corresponding to each entry date.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command extracts the ``quarter`` component from the entry_date column in the DataFrame.** 
- This operation is made possible by the **``dt accessor``**, which provides **``access to datetime-specific properties``**.

In [79]:
# Extract the quarter from the entry_date column

df.entry_date.dt.quarter

0      4
1      4
2      4
3      4
4      4
      ..
906    4
907    4
908    4
909    4
910    4
Name: entry_date, Length: 911, dtype: int32

- **``Quarter Calculation``**: The dt.quarter property returns an integer indicating the quarter of the year:
  - **``1``**: January to March
  - **``2``**: April to June
  - **``3``**: July to September
  - **``4``**: October to December
- **``Type``**: The result is a Series of integers, each representing the quarter corresponding to the respective entry date.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command extracts the ``dayofweek`` component from the entry_date column in the DataFrame.** 
- This operation is made possible by the **``dt accessor``**, which provides **``access to datetime-specific properties``**.

In [80]:
# Extract the day of the week from the entry_date column

df.entry_date.dt.dayofweek

0      1
1      1
2      1
3      1
4      1
      ..
906    2
907    2
908    4
909    1
910    3
Name: entry_date, Length: 911, dtype: int32

- **``Day of the Week Calculation``**: The dt.dayofweek property returns an integer where:
  - **``0``**: Monday
  - **``1``**: Tuesday
  - **``2``**: Wednesday
  - **``3``**: Thursday
  - **``4``**: Friday
  - **``5``**: Saturday
  - **``6``**: Sunday
- **``Type``**: The result is a Series of integers, each representing the day of the week corresponding to the respective entry date.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Datetime Module</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- The datetime module supplies classes for manipulating dates and times [SOURCE](https://docs.python.org/3/library/datetime.html).

The **``datetime module``** in **``Python``** is a built-in library that provides classes for manipulating dates and times. It allows users to create, modify, and format date and time objects, making it essential for tasks involving time calculations, comparisons, and formatting.

- **``Key Features:``**
  - **``Classes``**: Main classes include datetime (for combined date and time), date (for date only), time (for time only), timedelta (for representing time differences), and timezone (for handling time zones).
  - **``Arithmetic``**: Supports operations such as addition and subtraction of dates and times, enabling easy calculation of durations.
  - **``Formatting``**: Offers methods to format dates and times as strings using various formats, which is useful for display and reporting.
  - **``Parsing``**: Can parse strings into datetime objects using specified formats.


### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>class datetime.datetime</strong></p>


- A combination of a date and a time. Attributes: year, month, day, hour, minute, second, microsecond, and tzinfo.

The **``datetime.datetime class``** in Python is **``part``** of the **``datetime module``** and is used to represent both date and time. It combines the functionality of the date and time classes, allowing for comprehensive manipulation of date and time data.

In [81]:
# Import datetime class from datatime module

from datetime import datetime



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command ``obtains the current local date and time`` as a ``datetime object``.**
- This method captures the **``exact moment``** at which it is called, including the year, month, day, hour, minute, second, and microsecond.

In [82]:
# Display the current date and time

datetime.now()

datetime.datetime(2024, 10, 19, 19, 5, 41, 57036)

This output is a representation of the **``datetime object itself``**. It shows the full structure of the object.


- **``Local Time``**: The **``now()``** method returns the date and time in the **``local timezone of the system``** where the code is executed.
- **``Precision``**: The result includes **``microsecond precision``**, allowing for very precise timing if needed.
- **``Datetime Object``**: The output is a **``datetime object``**, which means we can use various methods and properties to manipulate or format this date and time.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [83]:
# Display the current date and time

print(datetime.now())

2024-10-19 19:05:41.065679

This output is a **``string representation of the datetime object``**, formatted in a **``human-readable way``**. It uses the ISO 8601 format.

- **``Object Representation``**: **``datetime.now()``** gives us a **``detailed object representation``**, useful for programmatic manipulation.
- **``String Representation``**: **``print(datetime.now())``** provides a **``formatted string representation``** that is easier to read for display purposes.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:blue; font-size:125%; text-align:left;">üì¢üëâ Note that the microsecond value shown here is slightly different (768490) from the earlier representation (758825) due to the time taken to execute the code between calls.</p>



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following command returns the ``current local date and time`` as a ``datetime object``, similar to datetime.now(), but it does NOT take any parameters.**

In [84]:
# Get the current local date and time

print(datetime.today())

2024-10-19 19:05:41.073307

- **``Local Time``**: Like datetime.now(), datetime.today() returns the date and time in the local timezone of the system.
- **``Precision``**: The output includes microsecond precision, providing a very precise timestamp.
- **``Datetime Object``**: The output is a datetime object, allowing for various manipulations, such as extracting components (year, month, day, etc.) or performing arithmetic.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [85]:
# Get the current local date and time and assign it to an object
current_datetime = datetime.now()

# Print the Datetime Object in a String Representation
print(current_datetime)

2024-10-19 19:05:41.081444

- **``Format- ``**: The output is in the standard ISO 8601 format, which includes:
  - **``Date- ``**: YYYY-MM-DD (e.g., 2024-10-19)
  - **``Time- ``**: HH:MM:SS.ssssss (e.g., 00:47:34.768490)
  - **``HH- ``**: Hours (24-hour format)
  - **``MM- ``**: Minutes
  - **``SS- ``**: Seconds
  - **``ssssss- ``**: Microseconds
- **``Key Points:- ``**
  - **``Current Time- ``**: The datetime.now() method captures the exact time at which it is called, including the year, month, day, hour, minute, second, and microsecond.
  - **``Datetime Object- ``**: The result is a datetime object, which can be further manipulated or formatted as needed.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following method extracts the ``date (year, month, and day)`` from a ``datetime object``, returning it as a ``date object``.**
- This allows us to work specifically with the date portion, ignoring the time component.

In [86]:
# Extract the date portion

current_datetime.date() 

# it can be date, year, month, day, weekday, isoweekday, hour, minute, second, microsecond, tzinfo

datetime.date(2024, 10, 19)

- **``Date Object``**: The result is a date object, which contains only the year, month, and day.
- **``Format``**: The output is in the YYYY-MM-DD format, which is a standard way to represent dates.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The ``attribute year`` is used to ``extract the year component`` from a ``datetime object``.** 
- This provides an easy way to **``access just the year``** without needing to manipulate the entire datetime.

In [87]:
# Extract the year portion

current_datetime.year

2024

- **``Year Value``**: The result is an integer representing the current year.
- **``Direct Access``**: This attribute allows for quick access to the year without any additional formatting or calculations.
- **``Use Cases``**: Useful in scenarios where you need to check or log the year, perform calculations based on the year, or filter data by y

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following method obtains the ``day of the week`` as an ``integer`` from a ``datetime object``.**
- In this method, **``Monday``** is represented as **``0``** and **``Sunday``** as **``6``**.

In [88]:
# Get the weekday

current_datetime.weekday() 

# Return the day of the week as an integer, where Monday is 0 and Sunday is 6.

5

- **``Integer Representation``**: The output is an integer where:
  - **``0``**: Monday
  - **``1``**: Tuesday
  - **``2``**: Wednesday
  - **``3``**: Thursday
  - **``4``**: Friday
  - **``5``**: Saturday
  - **``6``**: Sunday
- **``Use Cases``**: This method is useful for:
  - **``Scheduling``**: Determining the day of the week for scheduling tasks or events.
  - **``Data Analysis``**: Analyzing trends based on days of the week (e.g., sales data).
  - **``Conditionals:``** Performing actions based on the day of the week (e.g., different operations for weekends vs. weekdays).

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following method obtains the ``day of the week`` as an ``integer`` from a ``datetime object``, following the ``ISO standard``.**
- In this method, **``Monday``** is represented as **``1``** and **``Sunday``** as **``7``**.

In [89]:
# Get the ISO weekday

current_datetime.isoweekday() 

# Return the day of the week as an integer, where Monday is 1 and Sunday is 7.

6

- **``Integer Representation``**: The output is an integer where:
  - **``1``**: Monday
  - **``2``**: Tuesday
  - **``3``**: Wednesday
  - **``4``**: Thursday
  - **``5``**: Friday
  - **``6``**: Saturday
  - **``7``**: Sunday
- **``Use Cases``**: This method is useful for:
  - **``Standardization``**: Following the ISO standard can be beneficial for international applications.
  - **``Conditionals``**: Easily implement logic based on weekdays, such as different operations for weekends versus weekdays.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>class datetime.timedelta</strong></p>


- A **``duration``** expressing the **``difference between two date``**, time, or datetime instances to microsecond resolution [SOURCE](https://www.geeksforgeeks.org/manipulate-date-and-time-with-the-datetime-module-in-python/).

The **``datetime.timedelta class``** in **``Python's datetime module``** represents a **``duration``**, which is the **``difference between two dates or times``**. It is used for **``performing arithmetic``** with datetime objects, allowing us to add or subtract time intervals.

We can create a timedelta object by specifying any combination of days, seconds, microseconds, milliseconds, minutes, hours, and weeks. The parameters are: days, seconds, microseconds, milliseconds, minutes, hours, and weeks.
- **``Attributes``**: We can access the following attributes:
  - **``.days``**: The number of days in the duration.
  - **``.seconds``**: The number of seconds (0-86399).
  - **``.microseconds``**: The number of microseconds (0-999999).
- **``Operations``**: We can perform arithmetic operations with timedelta objects and datetime objects:
  - Addition and subtraction with datetime objects to find future or past dates.
  - Addition and subtraction between timedelta objects to calculate durations.

In [90]:
# Import datetime class from timedelta module

from datetime import timedelta



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [91]:
# Calculate a timedelta representing 2 days

timedelta(days=2)

datetime.timedelta(days=2)

This output is a **``representation of the timedelta object itself``**. It shows the full structure of the object.

- **``Object Representation``**: **``timedelta(days=2)``** gives us a **``detailed object representation``**, useful for programmatic manipulation.
- **``String Representation``**: **``timedelta(days=2)``** provides a **``formatted string representation``** that is easier to read for display purposes.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [92]:
# Calculate a timedelta representing 2 days

print(timedelta(days=2))

2 days, 0:00:00

This output is a **``string representation of the timedelta object``**, formatted in a **``human-readable way``**. It is a combination of days and time, making it clear how long the duration is.

- **``String Representation``**: **``timedelta(days=2)``** provides a **``formatted string representation``** that is easier to read for display purposes.

  - **``2 days``**: This indicates that the duration is 2 days.
  - **``0:00:00``**: This part represents the time component of the timedelta, which is zero hours, zero minutes, and zero seconds in this case.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [93]:
# Let's remember our Datatime Object where we stored the current datetime

current_datetime

datetime.datetime(2024, 10, 19, 19, 5, 41, 81444)



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``calculates a new datetime`` that  2 days before current_datetime.**

In [94]:
# Subtracting 2 days from the current local date and assign it into the Datatime Object
two_days_before = current_datetime - timedelta(days=2)

# Display the Datatime Object
two_days_before

datetime.datetime(2024, 10, 17, 19, 5, 41, 81444)

- **``current_datetime``**: Stores the current date and time.
- **``two_days_before``**: Shows the date and time exactly 2 days prior to current_datetime.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``calculates a new datetime`` that is ``2 weeks, 3 days, 4 hours, and 10 minutes later than current_datetime``.**
- This operation uses the timedelta class to represent the duration and adds it to the current datetime.

In [95]:
# Calculate the future datetime

current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10)

datetime.datetime(2024, 11, 5, 23, 15, 41, 81444)

- **``Current Date and Time``**: Displays the exact moment when the code was executed.
Future Date and Time``**: Shows the date and time that results from adding 2 weeks, 3 days, 4 hours, and 10 minutes to the current date and time.

**``Key Points:``**
- **``Date Arithmetic``**: This operation demonstrates how to perform complex date arithmetic using **``multiple parameters in timedelta``**.
- **``Flexible Calculation``**: We can adjust any of the parameters (weeks, days, hours, minutes) to suit our needs.
- **``Use Cases``**: Useful in scheduling tasks, setting reminders, or calculating future deadlines based on various time intervals.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code prints formatted output showing the ``current date and time``, the ``duration to be added``, and the ``total future date and time`` after adding the duration.**

In [96]:
print(f"{'Current Date': <15}:", current_datetime)

print(f"{'Additional Time': <15}:", timedelta(weeks=2, hours=4, minutes=10))

print(f"{'Future Date': <15}:", current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10))

Current Date   : 2024-10-19 19:05:41.081444
Additional Time: 14 days, 4:10:00
Future Date    : 2024-11-05 23:15:41.081444

- **``Current Date``**: Displays the current date and time stored in current_datetime.
- **``Additional Time``**: Shows the timedelta object representing the duration to be added, formatted as 14 days, 4:10:00 (2 weeks equals 14 days).
- **``Future Date``**: Represents the future date and time after adding 2 weeks, 3 days, 4 hours, and 10 minutes to the current datetime.

**``Key Points:``**
- **``Formatted Output``**: The f"{'label': <15}" syntax formats the string labels to be left-aligned within a width of 15 characters, ensuring a neat and organized appearance.
- **``Dynamic Calculation``**: Each time we run this code, it will calculate the current date and the future date based on the current moment, making it dynamic.
- **``Use Cases``**: This formatting is useful for displaying results in a readable format, especially in reports or logs.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>strftime()</strong></p>

- **Converting** from date/datetime/timedelta object **to string type** [SOURCE](https://strftime.org/)

The **``strftime()``** method in **``Python's datetime module``** is used to format datetime objects into **``readable strings``** according to specified format codes. This method allows us to create custom date and time representations, making it easier to display or log datetime information in a desired format. By using format strings, we can control the output to include components like year, month, day, hour, minute, second, and more, tailored to your application's needs.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [97]:
# Let's remember our current_datetime Object

current_datetime

datetime.datetime(2024, 10, 19, 19, 5, 41, 81444)



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [98]:
print(current_datetime)

2024-10-19 19:05:41.081444

- **``Date Part``**: This part represents the date in the format YYYY-MM-DD, indicating the year, month, and day.
- **``Time Part``**: This section represents the time in the format HH:MM:SS, indicating the hour, minute, and second.
- **``Nano Seconds Part``**: This number represents the microseconds, providing a high level of precision for the time.

**``Key Points:``**
- **``Datetime Object``**: The output is a representation of the datetime object, showcasing both the date and time components.
- **``Precision``**: The inclusion of microseconds allows for very precise measurements, which can be useful in applications requiring detailed time tracking.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression **``extracts the year``** component from a datetime object stored in the variable current_datetime.**
- This provides a simple way to access just the year without needing to manipulate the entire datetime.

In [99]:
# Extract the year

current_datetime.year

2024



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code returns type of datetime object stored in the variable current_datetime.**
- It returns <class 'int'>, indicating that the result of current_datetime.year is of type int.

In [100]:
# Extract the year and check its type

type(current_datetime.year)  # This is datetime.datetime class provided by Datetime Module

int



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#FF0000; font-size:125%; text-align:left;"><strong>‚ö†Ô∏è Watch out the difference ‚ùó‚ùó‚ùó</strong></p>

**The following expression ``formats the current_datetime object`` to return the ``year as a string`` in four-digit format.**
- The strftime() method allows you to specify a format using format codes.

In [101]:
# Format the year as a string

current_datetime.strftime("%Y")  # This is a strftime(format) method provided by Datetime Module

'2024'

- **``%Y``**: This format code represents the year with century as a decimal number (e.g., 2024).
- **``String Output``**: The result is a string representing the year, which can be useful for display purposes or when formatting data for reports.
- **``Customization``**: We can combine %Y with other format codes to create more complex date and time strings (e.g., "%Y-%m-%d %H:%M" for a full timestamp).

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code returns type of the formatted year.**

In [102]:
# Check the type of the formatted year

type(current_datetime.strftime("%Y"))

str



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [103]:
# Store the current local date and time
current_datetime = datetime.now()

# Extract and format year
year = current_datetime.strftime("%Y")
print(f"{'Current Year': <20}:", year)

# Extract and format month
month = current_datetime.strftime("%m")
print(f"{'Current Month': <20}:", month)

# Extract and format day
day = current_datetime.strftime("%d")
print(f"{'Current Day': <20}:", day)

# Extract and format time
time = current_datetime.strftime("%H:%M:%S")
print(f"{'Current Time': <20}:", time)


# Extract and format date and time
date_time = current_datetime.strftime("%m/%d/%Y, %H:%M:%S")
print(f"{'Current Date & Time': <20}:", date_time)

Current Year        : 2024
Current Month       : 10
Current Day         : 19
Current Time        : 19:05:41
Current Date & Time : 10/19/2024, 19:05:41



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>strptime()</strong></p>

- **Converting** from string type **to datetime object**

The **``strptime()``** method in **``Python's datetime module``** is used to **``parse a string representation of a date and time``** into a **``datetime object``**. This method allows us to **``convert strings formatted according to specific patterns into datetime objects``**, enabling easy manipulation and calculation of dates and times. By specifying a format string that matches the structure of the input string, we can accurately interpret and work with various date-time formats.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``converts the string date into a datetime object`` using the strptime() method**

In [104]:
# Parse the string into a datetime object
date_string = "21 June, 2018"

# Display the parsed datetime object
date_string

'21 June, 2018'

- **``%d``**: Day of the month as a zero-padded decimal number (01 to 31).
- **``%B``**: Full month name (e.g., January, February, ..., June).
- **``%Y``**: Year with century as a decimal number (e.g., 2018).


  - **``Conversion``**: The strptime() method successfully converts the date string into a datetime object, which can be used for further manipulation and calculations.
  - **``Format Matching``**: It‚Äôs crucial to ensure that the format string matches the structure of the date string for accurate parsing.


<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression converts a date string into a datetime object.**

In [105]:
datetime.strptime(date_string, "%d %B, %Y")

# datetime.strptime(date_string) # gives an error

datetime.datetime(2018, 6, 21, 0, 0)

- **``date_string``**: The string you want to convert, e.g., "21 June, 2018".
- **``"%d %B, %Y"``**: The format string that specifies how the components of the date string are laid out:
  - **``%d``**: Day of the month as a zero-padded decimal number (01 to 31).
  - **``%B``**: Full month name (e.g., January, February, ..., June).
  - **``%Y``**: Year with century as a decimal number (e.g., 2018).

- **``Conversion``**: strptime() successfully converts the string representation of the date into a datetime object, allowing for date manipulations and calculations.
- **``Use Cases``**: This method is useful for processing user input dates, reading dates from files, or converting formatted date strings from APIs.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following function ``converts a string representation of a date`` (or a list/array of date strings) into a ``datetime object`` or a series of datetime objects.**
- This function is particularly useful for data analysis, where we may need to handle dates in various formats.

In [106]:
# Convert the string to a datetime object

pd.to_datetime(date_string)

Timestamp('2018-06-21 00:00:00')

- **``date_string``**: A string representing a date, such as "21 June, 2018".
- **``pd.to_datetime(date_string)``**: This function attempts to parse the string and convert it into a Timestamp object (which is Pandas' equivalent of a datetime object).

- **``Flexibility``**: pd.to_datetime() can handle a variety of date formats, making it more versatile than standard strptime() in certain cases.
- **``Error Handling``**: It can also handle errors gracefully with parameters like errors='coerce', which will convert unparseable dates to NaT (Not a Time).
- **``Use Cases``**: This function is commonly used when loading datasets that contain date information, making it easier to analyze time series data

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``converts a date string into a datetime object`` using the strptime() method from Python's datetime module.**
- This allows us to create a datetime object that can be used for various date and time manipulations.

In [107]:
# Parse the string into a datetime object
datetime_object = datetime.strptime(date_string, "%d %B, %Y")

# Display the resulting datetime object
datetime_object

datetime.datetime(2018, 6, 21, 0, 0)



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code returns type of the datetime_object.**

In [108]:
type(datetime_object)

datetime.datetime

- **``date_string``**: The string you want to convert, e.g., "21 June, 2018".
- **``"%d %B, %Y"``**: The format string that specifies how the components of the date string are arranged:
  - **``%d``**: Day of the month as a zero-padded decimal number (01 to 31).
  - **``%B``**: Full month name (e.g., January, February, ..., June).
  - **``%Y``**: Year with century as a decimal number (e.g., 2018).

- **``Conversion``**: The strptime() method successfully converts the string representation of the date into a datetime object, allowing for further manipulation and calculations.
- **``Error Handling``**: If the string does NOT match the specified format, a ValueError will be raised, so it's important to ensure that the format string matches the date string exactly.
- **``Use Cases``**: This method is useful for parsing dates from user input, files, or APIs where dates are provided in string format.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``access the year component`` of a datetime object.**
- When we parse a date string into a datetime object using strptime(), we can easily retrieve individual components such as the year, month, day, hour, minute, and second.

In [109]:
# Extract the year

datetime_object.year

2018

- **``Year Value``**: The result is an integer representing the year (e.g., 2018).
- **``Direct Access``**: This attribute allows us to quickly access the year without additional formatting or calculations.
- **``Use Cases``**: Useful for filtering data, performing calculations based on the year, or logging purposes.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Operation with Datetime Object</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

## Let's detect the time between first order date and entry date for each product

In [110]:
# Let's remember our DataFrame

df

     id_product order_date  product_quantity  product_price entry_date
0           401 2021-01-23               1.0     541.487603 2018-12-04
1           416 2020-04-02               1.0     131.181818 2018-12-04
2           717 2019-03-10               1.0    2035.488500 2018-12-04
3           778 2019-12-27               1.0     335.988000 2018-12-04
4           826 2020-02-19               1.0     342.292302 2018-12-04
..          ...        ...               ...            ...        ...
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

[911 rows x 5 columns]



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>Let us do it by string methods:</strong></p>


**The following expression ``calculates the difference between two date columns`` in a Pandas DataFrame: ``order_date`` and ``entry_date``.**
- This operation results in a new Series that represents the duration between the two dates for each row.

In [111]:
df["order_date"] - df["entry_date"]

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Length: 911, dtype: timedelta64[ns]



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [112]:
# Calculate the difference between order_date and entry_date and create a new feature named "time_delta"


df["time_delta"] = df["order_date"] - df["entry_date"]

# Display the first three (3) entries in the updated DataFrame
df.head(3)

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781 days
1,416,2020-04-02,1.0,131.181818,2018-12-04,485 days
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96 days



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following operations ``converts the time differences into an integer representation of the days``.**

In [113]:
# Extract the number of days from the time_delta

df["time_delta"].astype("str").str.split(" ").str[0].astype(int)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [114]:
# Extract the number of days from the time_delta and reassign it to itself
df["time_delta"] = df["time_delta"].astype("str").str.split(" ").str[0].astype(int)

# Display the first and last five (5) entries in the updated DataFrame
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``calculates the minimum value of the time_delta column`` for ``each group`` defined by the id_product column in the DataFrame.**
- This operation is useful for summarizing data and understanding the smallest time difference associated with each product.

In [115]:
# Calculate the minimum time_delta for each id_product

df.groupby("id_product")["time_delta"].min()

id_product
401        781
416        485
717         96
778        388
826        442
          ...
1536841     38
1536842     48
1536887      9
1536952     63
1536974     10
Name: time_delta, Length: 498, dtype: int32

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>


**The following expression ``computes the minimum value of the time_delta column`` for ``each group`` defined by the id_product column, and then it ``returns a Series that aligns with the original DataFrame``.**
- This allows us to retain the structure of the DataFrame while adding a new column with the minimum values.

In [116]:
# Calculate the minimum time_delta for each id_product and align with original DataFrame

df.groupby("id_product")["time_delta"].transform("min")

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code ``creates a new column`` in the DataFrame that represents the ``passing_time_to_firstsale`` for ``each product identified by id_product``.**
- This provides insight into **``how long it takes for each product to reach its first sale``.

In [117]:
# Create a new column for the passing time to first sale
df["passing_time_to_firstsale"] = df.groupby("id_product")["time_delta"].transform("min")

# Display the updated DataFrame
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442
...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following method ``randomly select 10 rows`` from the DataFrame.**
- This is useful for quickly examining a subset of our data without having to display the entire DataFrame, especially when working with large datasets.

In [118]:
# Randomly sample 10 rows from the DataFrame

df.sample(10)

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
351,4283,2019-12-30,1.0,38.740363,2018-12-04,391,391
382,4525,2018-11-14,1.0,144.990000,2018-12-04,-20,-20
702,12900,2019-10-03,1.0,311.500000,2018-12-04,303,303
563,6791,2020-11-28,1.0,225.619835,2018-12-04,725,565
323,4166,2020-06-04,1.0,303.586800,2018-12-04,548,548
583,6918,2020-05-17,1.0,871.909091,2018-12-04,530,506
248,3766,2019-12-22,1.0,667.000000,2018-12-04,383,201
6,946,2019-08-09,1.0,597.988500,2018-12-04,248,248
675,12016,2019-05-06,3.0,411.842562,2018-12-04,153,153
5,916,2020-01-11,1.0,803.988000,2018-12-04,403,403



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

## Let's detect the time between last order date and today for each product

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>This time, let us do it by datetime properties:</strong></p>


**The following expression ``finds the latest (maximum) order_date`` for ``each unique id_product`` in the DataFrame.**
- This operation helps summarize the data by identifying the most recent order date associated with each product.

In [119]:
# Calculate the latest order date for each id_product

df.groupby("id_product").order_date.max()

id_product
401       2021-01-23
416       2020-04-02
717       2019-03-10
778       2019-12-27
826       2020-02-19
             ...
1536841   2020-11-22
1536842   2020-11-24
1536887   2020-11-22
1536952   2021-01-26
1536974   2020-12-06
Name: order_date, Length: 498, dtype: datetime64[ns]



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``calculates the maximum (latest) order_date`` for ``each group defined by id_product``, and then it ``converts those dates to a date format`` (removing the time component).**

In [120]:
# Calculate the latest order date for each id_product and convert to date

df.groupby("id_product").order_date.transform("max").dt.date

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code ``compute`` the latest order date for each product`` in the DataFrame and ``convert those dates to a date format`` (removing the time component).**
- This results in a Series that contains the latest order date for each row, based on the product ID.

In [121]:
# Calculate the latest order date for each id_product and convert to date then create a new feature

last_order_date = df.groupby("id_product").order_date.transform("max").dt.date



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code ``converts a string representation of a date into a Python date object``.**

In [122]:
# Convert string to date and assign it to "today"
today = pd.to_datetime("27-02-2021", format='%d-%m-%Y').date()

print(today)

2021-02-27



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following expression ``calculates the difference between a specific date (represented by the variable today) and a Series of dates (represented by last_order_date)``.**
- This operation yields a Series of timedelta objects, which represent the differences in days between the two dates.

In [123]:
# Calculate the difference between today and last_order_date

today - last_order_date

0       35 days, 0:00:00
1      331 days, 0:00:00
2      720 days, 0:00:00
3      428 days, 0:00:00
4      374 days, 0:00:00
             ...
906     95 days, 0:00:00
907     95 days, 0:00:00
908     97 days, 0:00:00
909     32 days, 0:00:00
910     83 days, 0:00:00
Name: order_date, Length: 911, dtype: object



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code ``creates a new column`` in the DataFrame that represents the ``time elapsed since the last order date for each product``.**

In [124]:
# Calculate the passing time from last sale

df["passing_time_from_lastsale"] = today - last_order_date



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

In [125]:
# Display the updated DataFrame

df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781,"35 days, 0:00:00"
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485,"331 days, 0:00:00"
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96,"720 days, 0:00:00"
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388,"428 days, 0:00:00"
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442,"374 days, 0:00:00"
...,...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,"95 days, 0:00:00"
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,"95 days, 0:00:00"
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9,"97 days, 0:00:00"
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63,"32 days, 0:00:00"
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10,"83 days, 0:00:00"



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

**The following code ``converts the passing_time_from_lastsale column``, which contains ``timedelta objects``, into an ``integer representation of days``.**

In [126]:
df["passing_time_from_lastsale"] = df["passing_time_from_lastsale"].astype("str").str.split(" ").str[0].astype(int)

# Let's discover the modified DataFrame
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781,35
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485,331
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96,720
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388,428
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442,374
...,...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,95
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9,97
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63,32
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10,83



<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#0000FF; font-size:110%; text-align:left;"><strong>-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</strong></p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#E51A59; font-size:150%; text-align:center; border-radius:10px 10px;">End of the Session - 10</p>

<p style="text-align: center;"><img src="https://i.ibb.co/99DQ3TY/DS-Courses.png" class="img-fluid" 
alt="CLRSWY"></p>


<br><br><br>

<p style="text-align: center;"><img src="https://i.ibb.co/Rpz9L36/clarusway-logo-black.png" width="450" height="200" class="img-fluid" alt="CLRSWY_LOGO"></p>

<p style="background-color:#E51A59; font-family:newtimeroman; color:#FDFEFE; font-size:130%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>